```terraform
terraform apply -target="module.kubeflow_components" -auto-approve
Acquiring state lock. This may take a few moments...
module.eks_blueprints.module.aws_eks.module.kms.data.aws_partition.current: Reading...
module.eks_blueprints.module.aws_eks.module.kms.data.aws_caller_identity.current: Reading...
module.eks_blueprints_outputs.data.aws_caller_identity.current: Reading...
module.eks_blueprints.module.aws_eks.data.aws_caller_identity.current: Reading...
module.eks_blueprints_outputs.data.aws_region.current: Reading...
module.eks_blueprints.data.aws_partition.current: Reading...
module.eks_blueprints.data.aws_region.current: Reading...
module.eks_blueprints.data.aws_caller_identity.current: Reading...
data.aws_ec2_instance_type_offerings.availability_zones_cpu: Reading...
module.kubeflow_components.module.ack_sagemaker.aws_iam_policy.sagemaker_ack_controller_studio_access: Refreshing state... [id=arn:aws:iam::637423190872:policy/sagemaker-ack-controller-policy20240226114803330700000001]
module.eks_blueprints.module.aws_eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_blueprints.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_blueprints.data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.eks_blueprints_outputs.data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.eks_blueprints.module.aws_eks.data.aws_partition.current: Reading...
module.eks_blueprints_outputs.data.aws_partition.current: Reading...
module.eks_blueprints_outputs.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_blueprints.module.aws_eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-008a35a7b388c8497]
module.eks_blueprints.module.aws_eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_blueprints.module.aws_eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks_blueprints.module.aws_eks.aws_iam_role.this[0]: Refreshing state... [id=eks-hw-dev-cluster-role]
module.eks_blueprints.module.aws_eks.data.aws_caller_identity.current: Read complete after 0s [id=637423190872]
module.eks_blueprints.data.aws_caller_identity.current: Read complete after 0s [id=637423190872]
module.eks_blueprints.data.aws_iam_session_context.current: Reading...
module.eks_blueprints.module.aws_eks.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=637423190872]
module.eks_blueprints_outputs.data.aws_caller_identity.current: Read complete after 1s [id=637423190872]
data.aws_ec2_instance_type_offerings.availability_zones_cpu: Read complete after 1s [id=eu-west-1]
module.eks_blueprints.data.aws_iam_session_context.current: Read complete after 1s [id=arn:aws:sts::637423190872:assumed-role/highwind-dev-github-action-role/GitHubActions]
module.eks_blueprints.data.aws_iam_policy_document.eks_key: Reading...
module.eks_blueprints.data.aws_iam_policy_document.eks_key: Read complete after 0s [id=2505927186]
module.eks_blueprints.module.kms[0].aws_kms_key.this: Refreshing state... [id=ccfd83d1-1d32-4a3d-bdeb-e3384a31493e]
module.eks_blueprints.module.aws_eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=eks-hw-dev-cluster-role-20240226112131653500000004]
module.eks_blueprints.module.aws_eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=eks-hw-dev-cluster-role-20240226112131278900000003]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b597896ff7f5c272]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-03b70be6bcc4b90b4]
module.eks_blueprints.module.aws_eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0a81a72fc08f68300]
module.eks_blueprints.module.aws_eks.aws_security_group.node[0]: Refreshing state... [id=sg-0618ac1d086dbaade]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1816058113]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_ntp_udp"]: Refreshing state... [id=sgrule-2984953883]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-279629832]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-662120622]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_self_coredns_udp"]: Refreshing state... [id=sgrule-3494645344]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_cluster_443"]: Refreshing state... [id=sgrule-692153049]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_ntp_tcp"]: Refreshing state... [id=sgrule-3480546582]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1998975969]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1579912198]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3548008462]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["egress_nodes_443"]: Refreshing state... [id=sgrule-1462740420]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["egress_nodes_kubelet"]: Refreshing state... [id=sgrule-2590728528]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-38163540]
module.eks_blueprints.module.aws_eks.aws_eks_cluster.this[0]: Refreshing state... [id=eks-hw-dev]
module.eks_blueprints_outputs.data.aws_eks_cluster.eks_cluster: Reading...
module.kubeflow_components.kubernetes_namespace.kubeflow: Refreshing state... [id=kubeflow]
module.kubeflow_components.module.ack_sagemaker.module.irsa.kubernetes_namespace_v1.irsa[0]: Refreshing state... [id=ack-system]
module.eks_blueprints_outputs.data.aws_eks_cluster.eks_cluster: Read complete after 0s [id=eks-hw-dev]
module.kubeflow_components.module.ack_sagemaker.module.irsa.aws_iam_role.irsa[0]: Refreshing state... [id=ack-sagemaker-controller-irsa-eks-hw-dev-eu-west-1]
module.kubeflow_components.module.ack_sagemaker.module.irsa.aws_iam_role_policy_attachment.irsa[0]: Refreshing state... [id=ack-sagemaker-controller-irsa-eks-hw-dev-eu-west-1-20240226114806992900000003]
module.kubeflow_components.module.ack_sagemaker.module.irsa.aws_iam_role_policy_attachment.irsa[1]: Refreshing state... [id=ack-sagemaker-controller-irsa-eks-hw-dev-eu-west-1-20240226114806672800000002]
module.kubeflow_components.module.kubeflow_issuer.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=kubeflow-issuer]
module.kubeflow_components.module.ack_sagemaker.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=ack-sagemaker-controller]
module.kubeflow_components.module.kubeflow_istio.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=istio]
module.kubeflow_components.module.kubeflow_dex.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=dex]
module.kubeflow_components.module.kubeflow_oidc_authservice.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=oidc-authservice]
module.kubeflow_components.module.kubeflow_knative_serving.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=knative-serving]
module.kubeflow_components.module.kubeflow_cluster_local_gateway.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=cluster-local-gateway]
module.kubeflow_components.module.kubeflow_knative_eventing.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=knative-eventing]
module.kubeflow_components.module.kubeflow_roles.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=kubeflow-roles]
module.kubeflow_components.module.kubeflow_istio_resources.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=kubeflow-istio-resources]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=kubeflow-pipelines]
module.kubeflow_components.module.kubeflow_kserve.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=kserve]
module.kubeflow_components.module.kubeflow_models_web_app.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=models-web-app]
module.kubeflow_components.module.kubeflow_katib.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=katib]
module.kubeflow_components.module.kubeflow_central_dashboard.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=central-dashboard]
module.kubeflow_components.module.kubeflow_admission_webhook.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=admission-webhook]
module.kubeflow_components.module.kubeflow_notebook_controller.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=notebook-controller]
module.kubeflow_components.module.kubeflow_jupyter_web_app.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=jupyter-web-app]
module.kubeflow_components.module.kubeflow_profiles_and_kfam.aws_iam_policy.profile_controller_policy: Refreshing state... [id=arn:aws:iam::637423190872:policy/profile-controller-policy20240226120931728800000004]
module.kubeflow_components.module.kubeflow_profiles_and_kfam.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=profiles-and-kfam]
module.kubeflow_components.module.kubeflow_profiles_and_kfam.module.irsa.aws_iam_role.irsa[0]: Refreshing state... [id=profiles-controller-irsa-eks-hw-dev-eu-west-1]
module.kubeflow_components.module.kubeflow_profiles_and_kfam.module.irsa.aws_iam_role_policy_attachment.irsa[0]: Refreshing state... [id=profiles-controller-irsa-eks-hw-dev-eu-west-1-20240226120935988600000005]
module.kubeflow_components.module.kubeflow_profiles_and_kfam.kubernetes_annotations.sa_role_arn: Refreshing state... [id=apiVersion=v1,kind=ServiceAccount,name=profiles-controller-service-account,namespace=kubeflow]
module.kubeflow_components.module.kubeflow_volumes_web_app.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=volumes-web-app]
module.kubeflow_components.module.kubeflow_tensorboards_web_app.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=tensorboards-web-app]
module.kubeflow_components.module.kubeflow_tensorboard_controller.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=tensorboard-controller]
module.kubeflow_components.module.kubeflow_training_operator.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=training-operator]
module.kubeflow_components.module.kubeflow_aws_telemetry[0].module.helm_addon.helm_release.addon[0]: Refreshing state... [id=aws-telemetry]
module.kubeflow_components.module.kubeflow_user_namespace.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=user-namespace]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply" which may have affected this plan:

  # module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0] has changed
  ~ resource "helm_release" "addon" {
        id                         = "kubeflow-pipelines"
      ~ metadata                   = [
          ~ {
                name        = "kubeflow-pipelines"
              ~ revision    = 3 -> 4
              ~ values      = jsonencode(
                  ~ {
                      - s3 = {
                          - minioServiceHost   = "s3.amazonaws.com"
                          - minioServiceRegion = "eu-west-1"
                          - roleArn            = "arn:aws:iam::637423190872:role/ml-pipeline-irsa-eks-hw-dev-eu-west-1"
                        }
                    }
                )
              ~ version     = "0.2.2" -> "0.2.1"
                # (3 unchanged attributes hidden)
            },
        ]
        name                       = "kubeflow-pipelines"
        # (26 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo
or respond to these changes.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.kubeflow_components.data.aws_iam_role.pipeline_irsa_iam_role[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_role" "pipeline_irsa_iam_role" {
      + arn                  = (known after apply)
      + assume_role_policy   = (known after apply)
      + create_date          = (known after apply)
      + description          = (known after apply)
      + id                   = (known after apply)
      + max_session_duration = (known after apply)
      + name                 = "ml-pipeline-irsa-eks-hw-dev-eu-west-1"
      + path                 = (known after apply)
      + permissions_boundary = (known after apply)
      + role_last_used       = (known after apply)
      + tags                 = (known after apply)
      + unique_id            = (known after apply)
    }

  # module.kubeflow_components.data.aws_iam_role.user_namespace_irsa_iam_role[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_role" "user_namespace_irsa_iam_role" {
      + arn                  = (known after apply)
      + assume_role_policy   = (known after apply)
      + create_date          = (known after apply)
      + description          = (known after apply)
      + id                   = (known after apply)
      + max_session_duration = (known after apply)
      + name                 = "user-namespace-irsa-eks-hw-dev-eu-west-1"
      + path                 = (known after apply)
      + permissions_boundary = (known after apply)
      + role_last_used       = (known after apply)
      + tags                 = (known after apply)
      + unique_id            = (known after apply)
    }

  # module.kubeflow_components.module.kubeflow_pipeline_irsa[0].aws_iam_role.irsa[0] will be created
  + resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "oidc.eks.eu-west-1.amazonaws.com/id/3A3D4AA75D7EB0983C049C990B21E03D:aud" = "sts.amazonaws.com"
                              + "oidc.eks.eu-west-1.amazonaws.com/id/3A3D4AA75D7EB0983C049C990B21E03D:sub" = "system:serviceaccount:kubeflow:ml-pipeline"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::637423190872:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/3A3D4AA75D7EB0983C049C990B21E03D"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "AWS IAM Role for the Kubernetes service account ml-pipeline."
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ml-pipeline-irsa-eks-hw-dev-eu-west-1"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.kubeflow_components.module.kubeflow_pipeline_irsa[0].aws_iam_role_policy_attachment.irsa[0] will be created
  + resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"
      + role       = "ml-pipeline-irsa-eks-hw-dev-eu-west-1"
    }

  # module.kubeflow_components.module.user_namespace_irsa[0].aws_iam_role.irsa[0] will be created
  + resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "oidc.eks.eu-west-1.amazonaws.com/id/3A3D4AA75D7EB0983C049C990B21E03D:aud" = "sts.amazonaws.com"
                              + "oidc.eks.eu-west-1.amazonaws.com/id/3A3D4AA75D7EB0983C049C990B21E03D:sub" = "system:serviceaccount:kubeflow-user-example-com:default-editor"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::637423190872:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/3A3D4AA75D7EB0983C049C990B21E03D"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "AWS IAM Role for the Kubernetes service account default-editor."
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "user-namespace-irsa-eks-hw-dev-eu-west-1"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.kubeflow_components.module.user_namespace_irsa[0].aws_iam_role_policy_attachment.irsa[0] will be created
  + resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"
      + role       = "user-namespace-irsa-eks-hw-dev-eu-west-1"
    }

  # module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0] will be updated in-place
  ~ resource "helm_release" "addon" {
      ~ chart                      = "../../../charts/apps/kubeflow-pipelines/vanilla" -> "../../../charts/apps/kubeflow-pipelines/s3-only"
        id                         = "kubeflow-pipelines"
      ~ metadata                   = [
          - {
              - app_version = "2.0.0-alpha.7"
              - chart       = "kubeflow-pipelines"
              - name        = "kubeflow-pipelines"
              - namespace   = "default"
              - revision    = 4
              - values      = jsonencode({})
              - version     = "0.2.1"
            },
        ] -> (known after apply)
        name                       = "kubeflow-pipelines"
      ~ status                     = "failed" -> "deployed"
      ~ version                    = "0.2.1" -> "0.2.2"
        # (23 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.kubeflow_components.module.kubeflow_user_namespace.module.helm_addon.helm_release.addon[0] will be updated in-place
  ~ resource "helm_release" "addon" {
        id                         = "user-namespace"
        name                       = "user-namespace"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.
module.kubeflow_components.module.user_namespace_irsa[0].aws_iam_role.irsa[0]: Creating...
module.kubeflow_components.module.kubeflow_pipeline_irsa[0].aws_iam_role.irsa[0]: Creating...
module.kubeflow_components.module.user_namespace_irsa[0].aws_iam_role.irsa[0]: Creation complete after 2s [id=user-namespace-irsa-eks-hw-dev-eu-west-1]
module.kubeflow_components.module.kubeflow_pipeline_irsa[0].aws_iam_role.irsa[0]: Creation complete after 2s [id=ml-pipeline-irsa-eks-hw-dev-eu-west-1]
module.kubeflow_components.module.user_namespace_irsa[0].aws_iam_role_policy_attachment.irsa[0]: Creating...
module.kubeflow_components.module.kubeflow_pipeline_irsa[0].aws_iam_role_policy_attachment.irsa[0]: Creating...
module.kubeflow_components.module.user_namespace_irsa[0].aws_iam_role_policy_attachment.irsa[0]: Creation complete after 0s [id=user-namespace-irsa-eks-hw-dev-eu-west-1-20240314073803957400000001]
module.kubeflow_components.data.aws_iam_role.user_namespace_irsa_iam_role[0]: Reading...
module.kubeflow_components.module.kubeflow_pipeline_irsa[0].aws_iam_role_policy_attachment.irsa[0]: Creation complete after 0s [id=ml-pipeline-irsa-eks-hw-dev-eu-west-1-20240314073804007300000002]
module.kubeflow_components.data.aws_iam_role.pipeline_irsa_iam_role[0]: Reading...
module.kubeflow_components.data.aws_iam_role.user_namespace_irsa_iam_role[0]: Read complete after 1s [id=user-namespace-irsa-eks-hw-dev-eu-west-1]
module.kubeflow_components.data.aws_iam_role.pipeline_irsa_iam_role[0]: Read complete after 1s [id=ml-pipeline-irsa-eks-hw-dev-eu-west-1]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Modifying... [id=kubeflow-pipelines]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 10s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 20s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 30s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 40s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 50s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 1m0s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 1m10s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 1m20s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 1m30s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 1m40s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 1m50s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 2m0s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 2m10s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 2m20s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 2m30s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 2m40s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 2m50s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 3m0s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 3m10s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 3m20s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 3m30s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 3m40s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 3m50s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 4m0s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 4m10s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 4m20s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 4m30s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 4m40s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 4m50s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 5m0s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 5m10s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 5m20s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 5m30s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 5m40s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 5m50s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 6m0s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 6m10s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 6m20s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 6m30s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 6m40s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 6m50s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 7m0s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 7m10s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 7m20s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 7m30s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 7m40s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 7m50s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 8m0s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 8m10s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 8m20s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 8m30s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 8m40s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 8m50s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 9m0s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 9m10s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 9m20s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 9m30s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 9m40s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 9m50s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 10m0s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 10m10s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 10m20s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 10m30s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 10m40s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 10m50s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 11m0s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 11m10s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 11m20s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 11m30s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 11m40s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 11m50s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 12m0s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 12m10s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 12m20s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 12m30s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 12m40s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 12m50s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 13m0s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 13m10s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 13m20s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 13m30s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 13m40s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 13m50s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 14m0s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 14m10s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 14m20s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 14m30s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 14m40s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 14m50s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 15m0s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 15m10s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 15m20s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 15m30s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 15m40s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 15m50s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 16m0s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 16m10s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 16m20s elapsed]
module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0]: Still modifying... [id=kubeflow-pipelines, 16m30s elapsed]
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the result of this plan may not represent all of the changes requested by the current
│ configuration.
│ 
│ The -target option is not for routine use, and is provided only for exceptional situations such as recovering from errors or mistakes, or when Terraform specifically
│ suggests to use it as part of an error message.
╵
╷
│ Warning: Applied changes may be incomplete
│ 
│ The plan was created with the -target option in effect, so some changes requested in the configuration may have been ignored and the output values may not be fully
│ updated. Run the following command to verify that no other changes are pending:
│     terraform plan
│ 
│ Note that the -target option is not suitable for routine use, and is provided only for exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
╷
│ Error: Provider produced inconsistent final plan
│ 
│ When expanding the plan for module.kubeflow_components.module.kubeflow_user_namespace.module.helm_addon.helm_release.addon[0] to include new values learned so far
│ during apply, provider "registry.terraform.io/hashicorp/helm" produced an invalid new value for .metadata: was known, but now unknown.
│ 
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: context deadline exceeded
│ 
│   with module.kubeflow_components.module.kubeflow_pipelines.module.helm_addon.helm_release.addon[0],
│   on .terraform/modules/kubeflow_components.kubeflow_pipelines.helm_addon/modules/kubernetes-addons/helm-addon/main.tf line 1, in resource "helm_release" "addon":
│    1: resource "helm_release" "addon" {
│ 
╵
make: *** [deploy-kubeflow-components] Error 1
enigma@work terraform % 
```